app/Models/TransaksiModel.php

SELECT `transaksi`.*, `nama`, `no_hp`, `email`
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_wisatawan`
WHERE `id_wisata` = '4'
AND `tgl_transaksi` >= '2024-06-22'
AND `tgl_transaksi` <= '2024-06-22'
---
    public function getPengunjung($id_wisata, $mulai, $selesai)
    {
        $pengunjung = $this->select('transaksi.*, nama, no_hp, email')
            ->join('user', 'user.id_user = transaksi.id_wisatawan')
            ->where('id_wisata', $id_wisata)
            ->where('tgl_transaksi >=', $mulai)
            ->where('tgl_transaksi <=', $selesai)
            ->orderBy('tgl_transaksi', 'ASC')
            ->findAll();