app/Models/UserModel.php

    public function getUser($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin4'
AND `user`.`deleted_at` IS NULL
 LIMIT 1