app/Models/WisataModel.php

    function getAdminWisata($id_admin)
    {
        return $this->where('id_admin', $id_admin)->first();
---
SELECT *
FROM `wisata`
WHERE `id_admin` = '6'
AND `wisata`.`deleted_at` IS NULL
 LIMIT 1